{"data":{"site":{"siteMetadata":{"title":"RayLog","siteUrl":"https://rayleighko.github.io"}},"markdownRemark":{"html":"<!--more-->\n<h2>\"Unreal Engine Build\"</h2>\n<!--more-->\n<p>우선 이 글은 설명서나 빌드 방법에 대한 이야기를 하지 않을 것이다. 단순히 내가 빌드를 어떤 과정을 통해 진행했고, 어떤 문제가 있었는지에 대한 글일 것이다.</p>\n<p>사전 준비물은 'Visual Studio 201'7, 'Github ID'이다. 따라서 VS 15(Visual Studio 2017)에 대한 사전 지식과 Github를 모른다면 다소 복잡할 수 있다. 그러나 따라오지 못하는 것은 아니니 나와 함께 학습하길 바란다.</p>\n<hr>\n<p>우선 첫 번째로 해야할 것은 사전 준비물을 챙기는 것이다. 아주 상세하게 설명하고 싶지만 이미 <a href=\"https://www.epicgames.com/\">Epic Games</a>에서 제공하는 <a href=\"https://docs.unrealengine.com/latest/KOR/GettingStarted/DownloadingUnrealEngine/index.html\">Unreal Engin documents - 언리얼 엔진 소스 코드 내려받기</a>에서 자세하게 설명하고 있으니 그것을 따라가면 될 것이다. 이것은 내가 겪은 문제들을 기반으로 작성하기에 나와 다른 오류가 발생하면 <a href=\"https://www.google.com/\">Google</a>을 통해 검색하길 바란다.</p>\n<p>우선 나는 Epic Games에 가입하고 EpicGames와 나의 Github ID를 연동하는 것에서부터 막혔다. <a href=\"https://www.unrealengine.com/ko/ue4-on-github\">여기</a>를 참고하면 되는데, 나는 이걸 보면서 어디서 연동하는 거지? 했다.</p>\n<p>결국 내가 찾아낸 것은 Epic Games의 <a href=\"https://www.unrealengine.com/dashboard/personal\">여기</a>에서 '계정 연결 관리'를 들어가 아래 계정을 입력하고 사전에 가입된 이메일을 통해 깃헙에 있는 Epic Games에서 소스를 받으면 된다는 것이었다. (이걸 모르고 열심히 다른 걸 고민했다..) 나와 같은 실수를 하지 않길 바란다.</p>\n<p>그렇다면 <a href=\"https://docs.unrealengine.com/latest/KOR/GettingStarted/DownloadingUnrealEngine/index.html\">Unreal Engin documents - 언리얼 엔진 소스 코드 내려받기</a>을 잘 따라갔을 것이다. 나도 분명 잘 따라갔다. 그런데 setup을 하고 GenerateProjectFiles을 하고 나서 UE4.sln를 찾았는데 없는 것이다.. 여기서 왜 이런지 고민을 하며 검색을 했지만 사실상 크게 어려움이 없는 부분이라 다들 문제가 없었던 모양인지 자료가 없었다.</p>\n<p>그러다 문득 '관리자 권한으로 실행하지 않아서 그런가?'라고 생각해 시도해보고, '백신 프로그램이 문제인가?'라고 생각해 종료했다가 다시 시도해보고.. VS 2017에서의 문제일까.. 해서 지웠다가 다시 깔면서 환경설정 다시 해보고.. 그러다보니 결국엔 UE4.sln가 생겼다! 정확한 문제점은 확인하지 못했지만.. 결국 된 것이 아닌가! (중간에 재부팅도 했다...) 아무튼 이건 그렇게 넘어갔다.</p>\n<p>다음으로는 UE4를 VS2017로 실행하고 빌드하는 일만 남았다. (여기서 VS의 C++ 업데이트가 안되어 있으면 실행되지 않음 유의하길 바람) 빌드를 했다.</p>\n<p>그런데 여기서 또 문제가 생겼다. 빌드를 하다보니 중간중간 특정 파일에 따라서 백신이 실행되고 검사하고를 반복하더라.. 다시 백신을 끄고 재빌드를 했는데 이미 사용중이라는 오류가 떴다. 여기서 버퍼를 비우고 다시 실행했는데도 안되서 재부팅하고 빌드를 했다.</p>\n<p>마치 일기같은 언리얼 엔진 빌드 후기였다. 앞으로는 빌드한 걸 가지고 다양한 프로젝트를 할 계획이다(물론 한참 후).</p>","frontmatter":{"date":"July 12, 2017","path":"/blog/2017-07-12-unrealengine-study-1","tags":"unreal","title":"언리얼 엔진 개발환경 준비하기"}}},"pageContext":{"refPath":"/blog/2017-07-12-unrealengine-study-1","prev":{"frontmatter":{"title":"Cpp 기본 개념_5","path":"/blog/2017-07-10-c++-study-5"}},"next":false}}